app/controllers/links_controller.rb

  def create
    original_url = params[:link][:original_url]
    code = generate_code
    @link = Link.new(original_url: original_url, code: code)
    if @link.save
---
INSERT INTO "links" ("original_url", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["original_url", "https://www.youtube.com/watch?v=byoQsLNESy8&t=1312s"], ["code", "JuD2y"], ["created_at", "2022-04-07 18:12:50.093395"], ["updated_at", "2022-04-07 18:12:50.093395"]]